---
title: "Notes [Book] Data Science Handbook"
author: "by Jawad Haider"
format: 
  gfm: 
    toc: true
    toc-name: Contents
link-external-newwindow: true
html-math-method: katex
anchor-sections: true
smooth-scroll: true
link-external-icon: true
jupyter: python3
comments:
  hypothesis: 
    theme: clean
reference-location: margin

---

___

<center><a href=''><img src='../../../assets/img/logo1.png'/></a></center>

___ 


<center><em>Copyright Qalmaqihir</em></center>
<center><em>For more information, visit us at <a href='http://www.github.com/qalmaqihir/'>www.github.com/qalmaqihir/</a></em></center>

#  Example: US States Data
Merge and join operations come up most often when one is combining data from dif‚Äê
ferent sources. Here we will consider an example of some data about US states and
their populations.

In [1]:
import numpy as np
import pandas as pd

In [2]:
pop = pd.read_csv("../data/state-population.csv")
areas= pd.read_csv("../data/state-areas.csv")
abbrevs= pd.read_csv("../data/state-abbrevs.csv")

In [5]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [7]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [8]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

__Given this information, say we want to compute a relatively straightforward result:rank US states and territories by their 2010 population density__

In [14]:
merged=pd.merge(pop,abbrevs, how='outer',left_on='state/region',right_on='abbreviation')

In [15]:
merged

     state/region     ages  year   population    state abbreviation
0              AL  under18  2012    1117489.0  Alabama           AL
1              AL    total  2012    4817528.0  Alabama           AL
2              AL  under18  2010    1130966.0  Alabama           AL
3              AL    total  2010    4785570.0  Alabama           AL
4              AL  under18  2011    1125763.0  Alabama           AL
...           ...      ...   ...          ...      ...          ...
2539          USA    total  2010  309326295.0      NaN          NaN
2540          USA  under18  2011   73902222.0      NaN          NaN
2541          USA    total  2011  311582564.0      NaN          NaN
2542          USA  under18  2012   73708179.0      NaN          NaN
2543          USA    total  2012  313873685.0      NaN          NaN

[2544 rows x 6 columns]

In [16]:
merged=merged.drop('abbreviation',1)

/tmp/ipykernel_88168/2168094788.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  merged=merged.drop('abbreviation',1)

In [17]:
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [18]:
# CHeck if there is any mismatch,
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [19]:
## Some of the population and state info is null, lets check which one
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [20]:
merged[merged['state'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [21]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [22]:
# To fix the missing values of PR, USA
merged.loc[merged['state/region']=='PR', 'state']='Puerto Rico'
merged.loc[merged['state/region']=='USA', 'state']='United State'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [23]:
#Now lets merged the result wiht the area dataset
final=pd.merge(merged, areas, on='state',how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [24]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [26]:
# Lets check the regions which areas is null
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United State'], dtype=object)

In [29]:
# No area value for USA; we can either insert it by suming all the areas or just drop it
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

**Now we have all the data we need. To answer the question of interest, let‚Äôs first select
the portion of the data corresponding with the year 2000, and the total population.
We‚Äôll use the query() function to do this quickly (this requires the numexpr package
to be installed;**

In [30]:
data2000=final.query("year==2000 & ages=='total'")

In [31]:
data2000.head()

    state/region   ages  year  population       state  area (sq. mi)
28            AL  total  2000   4452173.0     Alabama        52423.0
68            AK  total  2000    627963.0      Alaska       656425.0
124           AZ  total  2000   5160586.0     Arizona       114006.0
162           AR  total  2000   2678588.0    Arkansas        53182.0
220           CA  total  2000  33987977.0  California       163707.0

Now let‚Äôs compute the population density and display it in order. We‚Äôll start by rein‚Äê
dexing our data on the state, and then compute the result:

In [32]:
data2000.set_index('state', inplace=True)
density=data2000['population']/data2000['area (sq. mi)']

In [33]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8412.441176
Puerto Rico             1084.098151
New Jersey               966.592639
Rhode Island             679.785113
Connecticut              615.399892
dtype: float64

In [34]:
density.tail()

state
South Dakota    9.800755
North Dakota    9.080434
Montana         6.146192
Wyoming         5.053262
Alaska          0.956641
dtype: float64